In [1]:
#import libraries
import pandas as pd
import numpy as np

In [2]:
#index arrays

a1= pd.Series([10,20,30,40,50], index=['A','B','C','D','E'])
print(a1)

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [3]:
#index Arrays

a1_obj= a1.index
print(a1_obj)

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [4]:
#index arrays
a1_obj[0]

'A'

In [5]:
a1[0]

10

In [6]:
a1_obj[-1:]

Index(['E'], dtype='object')

In [7]:
a1_obj[:-2]

Index(['A', 'B', 'C'], dtype='object')

In [8]:
a1_obj[2:4]

Index(['C', 'D'], dtype='object')

In [10]:
#creating a dataframe form clipboard
a1= pd.read_clipboard()
print(a1)

  first name last name  age
0       tinu     elejo   19
1      marek      zinn   56
2       lily    mososa   56
3     axelia     mosoa   12
4       john   chijika   35
5       hena   anthoul   35
6       rose    anthom   51
7       roni    kostre   19
8       ally    mcgart   18

In [11]:
#display the columns
a1.columns

Index(['first name', 'last name', 'age'], dtype='object')

In [12]:
#accesing column values
a1['first name']

0      tinu
1     marek
2      lily
3    axelia
4      john
5      hena
6      rose
7      roni
8      ally
Name: first name, dtype: object

In [13]:
#accesing multiple column
a1[['first name', 'age']]

  first name  age
0       tinu   19
1      marek   56
2       lily   56
3     axelia   12
4       john   35
5       hena   35
6       rose   51
7       roni   19
8       ally   18

In [14]:
#adding a column for testing 
a1['rank']= np.nan
print(a1)

  first name last name  age  rank
0       tinu     elejo   19   NaN
1      marek      zinn   56   NaN
2       lily    mososa   56   NaN
3     axelia     mosoa   12   NaN
4       john   chijika   35   NaN
5       hena   anthoul   35   NaN
6       rose    anthom   51   NaN
7       roni    kostre   19   NaN
8       ally    mcgart   18   NaN

In [15]:
#head and tail

a1.head()

  first name last name  age  rank
0       tinu     elejo   19   NaN
1      marek      zinn   56   NaN
2       lily    mososa   56   NaN
3     axelia     mosoa   12   NaN
4       john   chijika   35   NaN

In [16]:
a1.tail()

  first name last name  age  rank
4       john   chijika   35   NaN
5       hena   anthoul   35   NaN
6       rose    anthom   51   NaN
7       roni    kostre   19   NaN
8       ally    mcgart   18   NaN

In [17]:
#assigning values to dataframe using  1.numpy  2.Series

a2 = np.arange(20,29)
a1['rank']=a2

print(a1)

  first name last name  age  rank
0       tinu     elejo   19    20
1      marek      zinn   56    21
2       lily    mososa   56    22
3     axelia     mosoa   12    23
4       john   chijika   35    24
5       hena   anthoul   35    25
6       rose    anthom   51    26
7       roni    kostre   19    27
8       ally    mcgart   18    28

In [18]:
#assinging value to dataframe using Serires
a2 = pd.Series([10,11,12], index=[3,4,5])
a1['rank'] =a2

print(a1)

  first name last name  age  rank
0       tinu     elejo   19   NaN
1      marek      zinn   56   NaN
2       lily    mososa   56   NaN
3     axelia     mosoa   12  10.0
4       john   chijika   35  11.0
5       hena   anthoul   35  12.0
6       rose    anthom   51   NaN
7       roni    kostre   19   NaN
8       ally    mcgart   18   NaN

In [19]:
#delet a column
del(a1['age'])
print(a1)

  first name last name  rank
0       tinu     elejo   NaN
1      marek      zinn   NaN
2       lily    mososa   NaN
3     axelia     mosoa  10.0
4       john   chijika  11.0
5       hena   anthoul  12.0
6       rose    anthom   NaN
7       roni    kostre   NaN
8       ally    mcgart   NaN

In [20]:
#creating dataframe from dictionary

a1 = {'company':['bmw','audi','mercedes','bentley'],
                 'price':['1cr','2cr','3cr','5cr']}

print(a1)

{'company': ['bmw', 'audi', 'mercedes', 'bentley'], 'price': ['1cr', '2cr', '3cr', '5cr']}

In [21]:
a2 = pd.DataFrame(a1)
print(a2)

    company price
0       bmw   1cr
1      audi   2cr
2  mercedes   3cr
3   bentley   5cr